Repository: kant/butterflow-ui
Catalog: butterflow-ui/Localization/Localization.*.resx
Languages: ar, ja, ru, zh_cn

# AboutButterflowMenu
source: butterflow on github...
ar: butterflow على جيثب ...
ja: ギターのバターフロー...
ru: масляный поток на github ...
zh_cn: github上的butterflow ...

# AboutButterflowUIMenu
source: butterflow-ui on github...
ar: butterflow -ii على جيثب ...
ru: butterflow-ui на github ...
zh_cn: 在github上的butterflow-ui ...

# AboutMenu
source: About butterflow-ui
ar: حول butterflow -ii
ja: butterflow-uiについて
ru: О butterflow-ui
zh_cn: 关于butterflow-ui

# AdvancedOptionsGroupBox
source: Advanced Options
ar: خيارات متقدمة
ja: 高度なオプション
ru: Расширенные опции
zh_cn: 高级选项

# ClipTooltip
source: Clip a subregion in the video.
ar: مقطع منطقة فرعية في الفيديو.
ja: ビデオ内の部分領域をクリップする。
ru: Закрепите субрегион в видео.
zh_cn: 剪辑视频中的子区域。

# CommonOptionsGroupBox
source: Common Options
ar: خيارات مشتركة
ja: 共通オプション
ru: Общие параметры
zh_cn: 常见选项

# CustomPlaybackRateLabel
source: Custom Rate
ar: معدل مخصص
ja: カスタムレート
ru: Пользовательская ставка
zh_cn: 自定义费率

# EditMenu
source: _Edit
ar: _تصحيح
ja: _編集
ru: _Редактировать
zh_cn: _编辑

# FileInputGroupBox
source: Input
ar: إدخال
ja: 入力
ru: вход
zh_cn: 输入

# FileLabel
source: Video File
ar: ملف فيديو
ja: ビデオファイル
ru: Видеофайл
zh_cn: 视频文件

# FileMenu
source: _File
ar: _ملف
ja: _ファイル
ru: _Файл
zh_cn: _文件

# HeightLabel
source: Height
ar: ارتفاع
ja: 高さ
ru: Высота
zh_cn: 高度

# HelpMenu
source: _Help
ar: _مساعدة
ja: _助けて
ru: _Помогите
zh_cn: _帮帮我

# KeepAudioDescription
source: Renders the output video with the audio from the original video. In unchecked, no sound will be included in the output video.
ar: يعرض الفيديو الناتج مع الصوت من الفيديو الأصلي. في غير محدد ، لن يتم تضمين أي صوت في الفيديو الناتج.
ja: 出力ビデオを元のビデオからのオーディオでレンダリングします。チェックされていない場合、サウンドは出力ビデオに含まれません。
ru: Отображает видеоизображение с аудио из исходного видео. Неконтролируемый звук не будет включен в выходной видеосигнал.
zh_cn: 使用原始视频中的音频渲染输出视频。在未选中状态下，输出视频中不会包含任何声音。

# KeepAudioLabel
source: Keep Audio
ar: حافظ على الصوت
ja: オーディオを保持する
ru: Сохранить аудио
zh_cn: 保持音频

# LosslessDescription
source: Renders the video without lossy compression. The video will not lose any visual quality, but it will result in a very large output file.
ar: يعرض الفيديو دون ضغط الفقد. لن يفقد الفيديو أي جودة بصرية ، ولكنه سينتج عنه ملف إخراج كبير جدًا.
ja: 非可逆圧縮なしでビデオをレンダリングします。ビデオのビジュアル品質は損なわれませんが、出力ファイルが非常に大きくなります。
ru: Отображает видео без сжатия с потерями. Видео не потеряет визуального качества, но это приведет к очень большому выходному файлу.
zh_cn: 在没有有损压缩的情况下呈现视频。视频不会失去任何视觉质量，但会产生非常大的输出文件。

# LosslessLabel
source: Lossless Quality
ar: جودة بلا خسائر
ja: ロスレス品質
ru: Качество без потерь
zh_cn: 无损质量

# PlaybackRateDescription
source: Controls the new framerate of the output video. This can be set in both absolute and relative terms.
ar: يتحكم في معدل الإطارات الجديد لمخرجات الفيديو. يمكن تعيين هذا في كل من الشروط المطلقة والنسبية.
ja: 出力ビデオの新しいフレームレートを制御します。これは、絶対的および相対的な両方の用語で設定できます。
ru: Управляет новой частотой кадров выходного видео. Это можно установить как в абсолютном, так и в относительном терминах.
zh_cn: 控制输出视频的新帧速率。这可以用绝对和相对术语来设置。

# PlaybackRateLabel
source: Playback Rate
ar: معدل التشغيل
ja: 再生レート
ru: Скорость воспроизведения
zh_cn: 播放率

# PlayPauseTooltip
source: Play/Pause the video.
ar: تشغيل / إيقاف مؤقت للفيديو.
ja: ビデオを再生/一時停止する。
ru: Воспроизведение / Пауза видео.
zh_cn: 播放/暂停视频。

# RenderingLabel
source: Video Rendering
ar: تقديم الفيديو
ja: ビデオレンダリング
ru: Видеообъявления
zh_cn: 视频渲染

# ResolutionLabel
source: Output Resolution
ar: قرار الإخراج
ja: 出力解像度
ru: Разрешение вывода
zh_cn: 输出分辨率

# SkipBackTooltip
source: Skip backward in the video.
ar: تخطي للخلف في الفيديو.
ja: 動画の後ろをスキップしてください。
ru: Пропустите назад в видео.
zh_cn: 在视频中向后跳过。

# SkipForwardTooltip
source: Skip forward in the video.
ar: تخط إلى الأمام في الفيديو.
ja: ビデオで前方にスキップします。
ru: Пропустить вперед в видео.
zh_cn: 在视频中向前跳过。

# StopTooltip
source: Stop the video.
ar: أوقف الفيديو.
ja: ビデオを停止します。
ru: Остановите видео.
zh_cn: 停止视频。

# SubregionsDescription
source: Individual regions of the video to process.
ar: المناطق الفردية للفيديو لمعالجة.
ja: 処理するビデオの個々の領域。
ru: Отдельные области видео для обработки.
zh_cn: 要处理的视频的各个区域。

# SubregionsLabel
source: Subregions
ar: المناطق الفرعية
ja: サブリージョン
ru: Субрегионы
zh_cn: 分区域

# Title
source: butterflow-ui
ar: butterflow-واجهة المستخدم
ja: バターフロー
ru: butterflow-щ
zh_cn: butterflow的UI

# ToEndLabel
source: To End
ar: إلى النهاية
ja: 最後まで
ru: В конец
zh_cn: 结束

# WidthLabel
source: Width
ar: عرض
ja: 幅
ru: Ширина
zh_cn: 宽度

# _120fpsLabel
source: 120 fps
ar: 120 إطارًا في الثانية
ru: 120 кадров в секунду

# _24fpsLabel
source: 24 fps
ar: 24 إطارًا في الثانية
ru: 24 кадра в секунду

# _30fpsLabel
source: 30 fps
ar: 30 إطارًا في الثانية
ru: 30 кадров в секунду

# _60fpsLabel
source: 60 fps
ar: 60 إطارًا في الثانية
ru: 60 кадров в секунду

# CancelLabel
source: Cancel
ar: إلغاء
ja: キャンセル
ru: Отмена
zh_cn: 取消

# CancelTooltip
source: Cancel the current butterflow operation.
ar: إلغاء عملية butterflow الحالية.
ja: 現在のバターフロー操作をキャンセルします。
ru: Отмените текущую операцию масляного потока.
zh_cn: 取消当前的butterflow操作。

# FastPyramidsLabel
source: Use Fast Pyramids
ar: استخدم الأهرامات السريعة
ja: 高速ピラミッドを使用する
ru: Использование быстрых пирамид
zh_cn: 使用快速金字塔

# FileOutputGroupBox
source: Output
ar: انتاج |
ja: 出力
ru: Вывод
zh_cn: 产量

# FlowFilterLabel
source: Flow Filter
ar: فلتر التدفق
ja: フローフィルタ
ru: Фильтр потока
zh_cn: 流量过滤器

# FlowFilterTooltip
source: Filter used for optical flow estimation.
ar: مرشح يستخدم لتقدير التدفق البصري.
ja: オプティカルフロー推定に使用されるフィルタ。
ru: Фильтр, используемый для оценки оптического потока.
zh_cn: 用于光流估计的滤波器。

# IterationsLabel
source: Pyramid iterations
ar: تكرارات الهرم
ja: ピラミッド反復
ru: Итерации пирамид
zh_cn: 金字塔迭代

# IterationsTooltip
source: The number of iterations to use for each pyramid layer.
ar: عدد التكرارات المستخدمة لكل طبقة هرمية.
ja: 各ピラミッド層に使用する反復回数。
ru: Количество итераций, используемых для каждого слоя пирамиды.
zh_cn: 每个金字塔图层使用的迭代次数。

# KeepSubregionsLabel
source: Keep Subregions
ar: حافظ على مناطق فرعية
ja: サブリージョンを保持
ru: Сохранять субрегионы
zh_cn: 保留子区域

# KeepSubregionsTooltip
source: Renders subregions not explicitly specified.
ar: تجعل المناطق الفرعية غير محددة صراحة.
ja: 明示的に指定されていないサブ領域をレンダリングします。
ru: Показывает субрегионы, явно не указанные.
zh_cn: 渲染未明确指定的子区域。

# LevelsLabel
source: Levels
ar: مستويات
ja: レベル
ru: Уровни
zh_cn: 水平

# LevelsTooltip
source: The number of pyramid layers.
ar: عدد طبقات الهرم.
ja: ピラミッド層の数。
ru: Количество пирамидных слоев.
zh_cn: 金字塔层数。

# OpenMenuItem
source: _Open...
ar: _افتح...
ja: _開いた...
ru: _Открыто...
zh_cn: _打开...

# PixelNeighborhoodLabel
source: Pixel Neighborhood
ar: حي بكسل
ja: ピクセル近傍
ru: Пиксельное соседство
zh_cn: 像素邻居

# PixelNeighborhoodTooltip
source: Size of the pixel neighborhood.
ar: حجم حي البكسل.
ja: ピクセル近傍のサイズ。
ru: Размер окрестности пикселя.
zh_cn: 像素邻域的大小。

# ProcessLabel
source: Process
ar: معالجة
ja: プロセス
ru: Обработать
zh_cn: 处理

# ProcessTooltip
source: Process the video. This may be a long process.
ar: قم بمعالجة الفيديو. هذا قد يكون عملية طويلة.
ja: ビデオを処理します。これは長いプロセスかもしれません。
ru: Обработайте видео. Это может быть долгий процесс.
zh_cn: 处理视频。这可能是一个漫长的过程。

# PyramidScaleLabel
source: Pyramid Scale Factor
ar: عامل مقياس الهرم
ja: ピラミッドスケールファクタ
ru: Масштабный коэффициент пирамиды
zh_cn: 金字塔比例因子

# SaveAsMenuItem
source: Save Configuration _As...
ar: حفظ التهيئة _As ...
ja: 設定を保存する_As ...
ru: Сохранить конфигурацию _As ...
zh_cn: 保存配置_As ...

# SaveMenuItem
source: _Save Configuration...
ar: _حفظ التكوين...
ja: _保存設定...
ru: _Сохранить конфигурацию ...
zh_cn: _保存配置......

# SmoothDerivativeLabel
source: Smooth Derivative
ar: مشتقة سلسة
ja: スムーズデリバティブ
ru: Гладкий производный
zh_cn: 光滑的衍生物

# SmoothDerivativeTooltip
source: Size of the standard deviation used for smooth derivatives.
ar: حجم الانحراف المعياري المستخدم للمشتقات السلسة.
ja: 滑らかな導関数に使用される標準偏差のサイズ。
ru: Размер стандартного отклонения, используемого для гладких производных.
zh_cn: 用于平滑导数的标准偏差的大小。

# SmoothMotionLabel
source: Smooth Motion
ar: الحركة السلسة
ja: スムースモーション
ru: Плавное движение
zh_cn: 平稳运动

# SmoothMotionTooltip
source: Set to tune for smooth motion. This mode yields artifact-less frames by emphasizing blended frames over warping pixels.
ar: اضبط لضبط الحركة السلسة. ينتج هذا الوضع إطارات أقل تأثيرًا عن طريق التأكيد على الإطارات الممزوجة على وحدات البكسل المخروطية.
ja: 滑らかな動きに合わせて調整します。このモードは、ワーピングピクセル上でブレンドされたフレームを強調することによって、アーティファクトなしのフレームを生成します。
ru: Установите настройку для плавного движения. Этот режим дает без артефактов кадров, подчеркивая смешанные кадры по сравнению с пикселями пикселей.
zh_cn: 设置为调整平滑运动。此模式通过强调扭曲像素上的混合帧来产生无伪影帧。

# WindowSizeLabel
source: Window Size
ar: بحجم النافذه
ja: ウィンドウサイズ
ru: Размер окна
zh_cn: 窗口大小

# AboutWindowDescription
source: buttterflow-ui is a graphical user interface for the butterflow video processor.
ar: buttterflow-ui هي واجهة مستخدم رسومية لمعالج الفيديو butterflow.
ja: buttterflow-uiは、butterflowビデオプロセッサ用のグラフィカルユーザーインターフェイスです。
ru: buttterflow-ui - графический пользовательский интерфейс для видеопроцессора butterflow.
zh_cn: buttterflow-ui是butterflow视频处理器的图形用户界面。

# AboutWindowGithubLinkLabel
source: github
ar: جيثب
ja: ギブス
zh_cn: github上

# AboutWindowLicenseLinkLabel
source: license
ar: رخصة
ja: ライセンス
ru: лицензия
zh_cn: 执照

# AboutWindowTitle
source: About butterflow-ui
ar: حول butterflow -ii
ja: butterflow-uiについて
ru: О butterflow-ui
zh_cn: 关于butterflow-ui

# CopyArgumentsMenu
source: Copy butterflow arguments
ar: نسخ الحجج butterflow
ja: バターフローの引数をコピーする
ru: Копировать аргументы масляного потока
zh_cn: 复制butterflow参数

# DevelopersLabel
source: Developers and Contributors
ar: المطورين والمساهمين
ja: 開発者と貢献者
ru: Разработчики и участники
zh_cn: 开发人员和贡献者

# LanguageLabel
source: Language
ar: لغة
ja: 言語
ru: язык
zh_cn: 语言

# OKLabel
source: OK
ar: حسنا
ru: ОК
zh_cn: 好

# OpenSourceCreditsLabel
source: Open Source Libraries
ar: مكتبات المصدر المفتوح
ja: オープンソースライブラリ
ru: Библиотеки с открытым исходным кодом
zh_cn: 开源库

# OptionsMenu
source: Application Options...
ar: خيارات التطبيق ...
ja: アプリケーションオプション...
ru: Параметры приложения ...
zh_cn: 应用选项......

# OptionsWindowLanguageChangeNotice
source: Note: Changing the user language will require a restart of the program.
ar: ملاحظة: سيتطلب تغيير لغة المستخدم إعادة تشغيل البرنامج.
ja: 注：ユーザー言語を変更するには、プログラムを再起動する必要があります。
ru: Примечание. Для изменения языка пользователя потребуется перезапуск программы.
zh_cn: 注意：更改用户语言将需要重新启动程序。

# OptionsWindowTitle
source: Options
ar: خيارات
ja: オプション
ru: Опции
zh_cn: 选项

# SaveLabel
source: Save
ar: حفظ
ja: セーブ
ru: Сохранить
zh_cn: 保存

# VersionLabel
source: Version
ar: الإصدار
ja: バージョン
ru: Версия
zh_cn: 版

# ButterflowUIConfigurationLabel
source: ButterflowUI Configuration File
ar: ButterflowUI ملف التكوين
ja: ButterflowUI構成ファイル

# MultipleFilesPreviewWarningLabel
source: Video previewing and subregion clipping is not available when processing multiple files.
ar: لا تتوفر إمكانية معاينة الفيديو والقاطع الفرعي عند معالجة ملفات متعددة.
ja: 複数のファイルを処理する場合、ビデオのプレビューとサブリージョンのクリッピングは使用できません。

# MultipleFilesText
source: [Multiple Files]
ar: [ملفات متعددة]
ja: [複数のファイル]

# SupportedFileTypesLabel
source: Supported File Types
ar: أنواع الملفات المدعومة
ja: サポートされているファイルの種類

# BehindVersionStatusDescription
source: The current version is behind the github repository and should be updated.
ar: الإصدار الحالي هو وراء مستودع جيثب ويجب تحديثه.
ja: 現在のバージョンはgithubリポジトリの後ろにあり、更新する必要があります。

# CurrentVersionStatusDescription
source: The current version is up to date with the github repository.
ar: الإصدار الحالي محدث مع مستودع جيثب.
ja: 現在のバージョンはgithubリポジトリで最新のものです。

# CustomVersionStatusDescription
source: The current version is ahead of the github repository, or is a custom version of butterflow-ui that cannot be compared to the github repository.
ar: الإصدار الحالي هو قبل مستودع github ، أو هو نسخة مخصصة من butterflow -ii لا يمكن مقارنتها بمستودع جيثب.
ja: 現在のバージョンはgithubリポジトリより先にあるか、githubリポジトリと比較できないカスタムバージョンのbutterflow-uiです。

# UnknownVersionStatusDescription
source: Github failed to respond with the current version. This could be because of rate limits or a network failure.
ar: فشل Github للرد مع الإصدار الحالي. قد يكون ذلك بسبب حدود المعدل أو فشل الشبكة.
ja: Githubは現在のバージョンでは応答できませんでした。これは、レート制限またはネットワーク障害が原因である可能性があります。

# _2xLabel
source: 2x
ja: 2倍
zh_cn: 2倍

# _3xLabel
source: 3x
ja: 3倍

# _4xLabel
source: 4x
ja: 4倍

# EndLabel
source: E
ru: Е
zh_cn: Ë

# StartLabel
source: S
zh_cn: 小号
